
Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("");
	ПараметрыРегистрации.Назначение = МассивНазначений;   //!!
	ПараметрыРегистрации.Наименование = "Утилиты Построения Колонок";
	ПараметрыРегистрации.Версия = "1.1.1";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Информация = "Утилиты построения колонок";
	Возврат ПараметрыРегистрации;
КонецФункции